KCX-Mapping-Convert/testdaten/EMCS/UIDSfromKidsReferences/EMCSExportRejectionHgpUids.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Header xmlns="http://www.eurtradenet.com/schemas/header/200310" soap:mustUnderstand="true"><To>DE01.CSFALT.2144</To><From>DE01.CSFALT.2144</From><MessageID>DE-DIEH-TST000876130710</MessageID><InReplyTo>DE01DE0121810000000000649177</InReplyTo><SentAt>2010-07-14 12:02:00 +0200</SentAt><Act>inform</Act><Method>EMCS</Method><MessageVersion>1.0</MessageVersion><MessageType>EMCSRejectionOfEAADForExport</MessageType></Header></soap:Header><soap:Body><Submit xmlns="http://www.eurtradenet.com/schemas/uids/emcs/body/200911"><EMCS><EMCSRejectionOfEAADForExport><DateAndTimeOfIssuance>2010-07-13 12:27:00 +0200</DateAndTimeOfIssuance><ExportCrossCheckingDiagnoses><LocalReferenceNumber>0000000262/0090034409</LocalReferenceNumber><CancelExportFlag>true</CancelExportFlag><Diagnosis><AadReferenceCode>10DE00600000000026936</AadReferenceCode><BodyRecordUniqueReference>1</BodyRecordUniqueReference><DiagnosisCode>3</DiagnosisCode></Diagnosis><Diagnosis><AadReferenceCode>10DE00600000000026936</AadReferenceCode><BodyRecordUniqueReference>2</BodyRecordUniqueReference><DiagnosisCode>3</DiagnosisCode></Diagnosis><Diagnosis><AadReferenceCode>10DE00600000000026936</AadReferenceCode><BodyRecordUniqueReference>3</BodyRecordUniqueReference><DiagnosisCode>3</DiagnosisCode></Diagnosis></ExportCrossCheckingDiagnoses><Rejection><RejectionDateAndTime>2010-07-13 12:27:00 +0200</RejectionDateAndTime><RejectionReasonCode>4</RejectionReasonCode></Rejection><CAadVal><AadReferenceCode>10DE00600000000026936</AadReferenceCode><SequenceNumber>1</SequenceNumber><FunctionalError><ErrorType>0</ErrorType><ErrorPointer>/CD839A/</ErrorPointer><ErrorReason>AES-Vorgang passt nicht zum EMCS Vorgang</ErrorReason><OriginalAttributeValue>/OriginalAttributeValue/</OriginalAttributeValue></FunctionalError></CAadVal></EMCSRejectionOfEAADForExport></EMCS></Submit></soap:Body></soap:Envelope>
